Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2NSCHK" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003370">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x20" edc:desc="Port Security Attribution Check"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x40003374"/>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40003400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x40003401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="START0" edc:nzwidth="0x1" edc:desc="Comparator 0 Start Comparison"/>
            <edc:SFRFieldDef edc:cname="START1" edc:nzwidth="0x1" edc:desc="Comparator 1 Start Comparison"/>
            <edc:SFRFieldDef edc:cname="START2" edc:nzwidth="0x1" edc:desc="Comparator 2 Start Comparison"/>
            <edc:SFRFieldDef edc:cname="START3" edc:nzwidth="0x1" edc:desc="Comparator 3 Start Comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="EVCTRL" edc:nzwidth="0x10" edc:access="nnnnnnnn--nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF3F" edc:_addr="0x40003402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMPEO0" edc:nzwidth="0x1" edc:desc="Comparator 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEO1" edc:nzwidth="0x1" edc:desc="Comparator 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEO2" edc:nzwidth="0x1" edc:desc="Comparator 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEO3" edc:nzwidth="0x1" edc:desc="Comparator 3 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="WINEO0" edc:nzwidth="0x1" edc:desc="Window 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="WINEO1" edc:nzwidth="0x1" edc:desc="Window 1 Event Output Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COMPEI0" edc:nzwidth="0x1" edc:desc="Comparator 0 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEI1" edc:nzwidth="0x1" edc:desc="Comparator 1 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEI2" edc:nzwidth="0x1" edc:desc="Comparator 2 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEI3" edc:nzwidth="0x1" edc:desc="Comparator 3 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:nzwidth="0x1" edc:desc="Comparator 0 Input Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:nzwidth="0x1" edc:desc="Comparator 1 Input Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="INVEI2" edc:nzwidth="0x1" edc:desc="Comparator 2 Input Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="INVEI3" edc:nzwidth="0x1" edc:desc="Comparator 3 Input Event Invert Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x40003404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:nzwidth="0x1" edc:desc="Comparator 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:nzwidth="0x1" edc:desc="Comparator 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:nzwidth="0x1" edc:desc="Window 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x40003405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:nzwidth="0x1" edc:desc="Comparator 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:nzwidth="0x1" edc:desc="Comparator 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:nzwidth="0x1" edc:desc="Window 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x40003406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1"/>
            <edc:SFRFieldDef edc:cname="COMP2" edc:nzwidth="0x1" edc:desc="Comparator 2"/>
            <edc:SFRFieldDef edc:cname="COMP3" edc:nzwidth="0x1" edc:desc="Comparator 3"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0"/>
            <edc:SFRFieldDef edc:cname="WIN1" edc:nzwidth="0x1" edc:desc="Window 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="STATUSA" edc:nzwidth="0x8" edc:access="rrrrrrrr" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40003407">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="STATE0" edc:nzwidth="0x1" edc:desc="Comparator 0 Current State"/>
            <edc:SFRFieldDef edc:cname="STATE1" edc:nzwidth="0x1" edc:desc="Comparator 1 Current State"/>
            <edc:SFRFieldDef edc:cname="STATE2" edc:nzwidth="0x1" edc:desc="Comparator 2 Current State"/>
            <edc:SFRFieldDef edc:cname="STATE3" edc:nzwidth="0x1" edc:desc="Comparator 3 Current State"/>
            <edc:SFRFieldDef edc:cname="WSTATE0" edc:nzwidth="0x2" edc:desc="Window 0 Current State">
              <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Signal is above window" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Signal is inside window" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Signal is below window" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WSTATE1" edc:nzwidth="0x2" edc:desc="Window 1 Current State">
              <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Signal is above window" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Signal is inside window" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Signal is below window" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
