Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER49" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42000151">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x4" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER50" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42000152">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x4" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER51" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42000153">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x4" edc:desc="Channel Event Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x42000154"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x420001D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x420001D5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x420001D6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x420001D7"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NONSECCHAN" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x420001D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 0"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 2"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 3"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 4"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 5"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 6"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 7"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 8"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 9"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 10"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:nzwidth="0x1" edc:desc="Non-Secure for Channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NSCHKCHAN" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x420001DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x1" edc:desc="Channel 0 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x1" edc:desc="Channel 1 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:nzwidth="0x1" edc:desc="Channel 2 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:nzwidth="0x1" edc:desc="Channel 3 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:nzwidth="0x1" edc:desc="Channel 4 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:nzwidth="0x1" edc:desc="Channel 5 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:nzwidth="0x1" edc:desc="Channel 6 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:nzwidth="0x1" edc:desc="Channel 7 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:nzwidth="0x1" edc:desc="Channel 8 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:nzwidth="0x1" edc:desc="Channel 9 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:nzwidth="0x1" edc:desc="Channel 10 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:nzwidth="0x1" edc:desc="Channel 11 to be checked as non-secured"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NONSECUSER0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420001E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:nzwidth="0x1" edc:desc="Non-Secure for User 0"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:nzwidth="0x1" edc:desc="Non-Secure for User 1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:nzwidth="0x1" edc:desc="Non-Secure for User 2"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:nzwidth="0x1" edc:desc="Non-Secure for User 3"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:nzwidth="0x1" edc:desc="Non-Secure for User 4"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:nzwidth="0x1" edc:desc="Non-Secure for User 5"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:nzwidth="0x1" edc:desc="Non-Secure for User 6"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:nzwidth="0x1" edc:desc="Non-Secure for User 7"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:nzwidth="0x1" edc:desc="Non-Secure for User 8"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:nzwidth="0x1" edc:desc="Non-Secure for User 9"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:nzwidth="0x1" edc:desc="Non-Secure for User 10"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:nzwidth="0x1" edc:desc="Non-Secure for User 11"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:nzwidth="0x1" edc:desc="Non-Secure for User 12"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:nzwidth="0x1" edc:desc="Non-Secure for User 13"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:nzwidth="0x1" edc:desc="Non-Secure for User 14"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:nzwidth="0x1" edc:desc="Non-Secure for User 15"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:nzwidth="0x1" edc:desc="Non-Secure for User 16"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:nzwidth="0x1" edc:desc="Non-Secure for User 17"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:nzwidth="0x1" edc:desc="Non-Secure for User 18"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:nzwidth="0x1" edc:desc="Non-Secure for User 19"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:nzwidth="0x1" edc:desc="Non-Secure for User 20"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:nzwidth="0x1" edc:desc="Non-Secure for User 21"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:nzwidth="0x1" edc:desc="Non-Secure for User 22"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:nzwidth="0x1" edc:desc="Non-Secure for User 23"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:nzwidth="0x1" edc:desc="Non-Secure for User 24"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:nzwidth="0x1" edc:desc="Non-Secure for User 25"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:nzwidth="0x1" edc:desc="Non-Secure for User 26"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:nzwidth="0x1" edc:desc="Non-Secure for User 27"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:nzwidth="0x1" edc:desc="Non-Secure for User 28"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:nzwidth="0x1" edc:desc="Non-Secure for User 29"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:nzwidth="0x1" edc:desc="Non-Secure for User 30"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:nzwidth="0x1" edc:desc="Non-Secure for User 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
