Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM91" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200576C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM92" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005770">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM93" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005774">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM94" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005778">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM95" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200577C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM96" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005780">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM97" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005784">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM98" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005788">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM99" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200578C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM100" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005790">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM101" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005794">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM102" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42005798">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM103" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200579C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM104" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
