Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PART_1" edc:nzwidth="0x4" edc:desc="Part number bits[11:8]"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:nzwidth="0x4" edc:desc="JEP106 identification code bits [3:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="DES_1" edc:nzwidth="0x3" edc:desc="JEP106 identification code bits[6:4]"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:nzwidth="0x1" edc:desc="JEDEC assignee value is used"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Component revision"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_PIDR3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0001FEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CMOD" edc:nzwidth="0x4" edc:desc="Customer Modified"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:nzwidth="0x4" edc:desc="RevAnd"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CIDR0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:impl="0xFF" edc:_addr="0xE0001FF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CIDR1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010010000" edc:mclr="00000000000000000000000010010000" edc:impl="0xFF" edc:_addr="0xE0001FF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:nzwidth="0x4" edc:desc="CoreSight component identification preamble"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:nzwidth="0x4" edc:desc="CoreSight component class"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CIDR2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:impl="0xFF" edc:_addr="0xE0001FF8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CIDR3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:impl="0xFF" edc:_addr="0xE0001FFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_CTRL" edc:nzwidth="0x20" edc:access="nnnn-------------nnnnnnnnnnn--nn" edc:impl="0xF0007FF3" edc:_addr="0xE0002000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Flash Patch global enable"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x1" edc:desc="FP_CTRL write-enable key"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE" edc:nzwidth="0x4" edc:desc="Number of implemented code comparators bits [3:0]"/>
            <edc:SFRFieldDef edc:cname="NUM_LIT" edc:nzwidth="0x4" edc:desc="Number of literal comparators"/>
            <edc:SFRFieldDef edc:cname="NUM_CODE_1" edc:nzwidth="0x3" edc:desc="Number of implemented code comparators bits [6:4]"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="REV" edc:nzwidth="0x4" edc:desc="Revision"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_REMAP" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrr-----" edc:impl="0x3FFFFFE0" edc:_addr="0xE0002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="REMAP" edc:nzwidth="0x18" edc:desc="Remap address"/>
            <edc:SFRFieldDef edc:cname="RMPSPT" edc:nzwidth="0x1" edc:desc="Remap supported"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
