Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DCRSR" edc:nzwidth="0x20" edc:access="---------------w---------wwwwwww" edc:impl="0x1007F" edc:_addr="0xE000EDF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:nzwidth="0x7" edc:desc="Register selector"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:nzwidth="0x1" edc:desc="Register write/not-read access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000EDF8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DEMCR" edc:nzwidth="0x20" edc:access="-------n---nnnnn----nnnnnnnn---n" edc:impl="0x11F0FF1" edc:_addr="0xE000EDFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:nzwidth="0x1" edc:desc="Core reset Halting debug vector catch enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:nzwidth="0x1" edc:desc="MemManage exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:nzwidth="0x1" edc:desc="UsageFault exception coprocessor access Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:nzwidth="0x1" edc:desc="UsageFault exception checking error Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:nzwidth="0x1" edc:desc="UsageFault exception state information error Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:nzwidth="0x1" edc:desc="BusFault exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:nzwidth="0x1" edc:desc="Excception entry and return faults Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:nzwidth="0x1" edc:desc="HardFault exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_SFERR" edc:nzwidth="0x1" edc:desc="SecureFault exception Halting debug vector catch enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:nzwidth="0x1" edc:desc="DebugMonitor enable"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:nzwidth="0x1" edc:desc="DebugMonitor pending state"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:nzwidth="0x1" edc:desc="Enable DebugMonitor stepping"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:nzwidth="0x1" edc:desc="DebugMonitor semaphore bit"/>
            <edc:SFRFieldDef edc:cname="SDME" edc:nzwidth="0x1" edc:desc="Secure DebugMonitor enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:nzwidth="0x1" edc:desc="Global DWT and ITM features enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000EE00"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DAUTHCTRL" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0xE000EE04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="SPIDENSEL" edc:nzwidth="0x1" edc:desc="Secure invasive debug enable select"/>
            <edc:SFRFieldDef edc:cname="INTSPIDEN" edc:nzwidth="0x1" edc:desc="Internal Secure invasive debug enable"/>
            <edc:SFRFieldDef edc:cname="SPNIDENSEL" edc:nzwidth="0x1" edc:desc="Secure non-invasive debug enable select"/>
            <edc:SFRFieldDef edc:cname="INTSPNIDEN" edc:nzwidth="0x1" edc:desc="Internal Secure non-invasive debug enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DSCSR" edc:nzwidth="0x20" edc:access="--------------nn--------------nn" edc:impl="0x30003" edc:_addr="0xE000EE08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="SBRSELEN" edc:nzwidth="0x1" edc:desc="Secure Banked register select enable"/>
            <edc:SFRFieldDef edc:cname="SBRSEL" edc:nzwidth="0x1" edc:desc="Secure Banked register select"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="CDS" edc:nzwidth="0x1" edc:desc="Current domain Secure"/>
            <edc:SFRFieldDef edc:cname="CDSKEY" edc:nzwidth="0x1" edc:desc="CDS field write-enable key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1A4" edc:_addr="0xE000EE0C"/>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DLAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE000EFB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock access control">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DLSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE000EFB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="SLI" edc:nzwidth="0x1" edc:desc="Software Lock implemented"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:nzwidth="0x1" edc:desc="Software Lock status"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:nzwidth="0x1" edc:desc="Not thirty-two bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DAUTHSTATUS" edc:nzwidth="0x20" edc:access="------------------------rrrr-r-r" edc:impl="0xF5" edc:_addr="0xE000EFB8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="NSID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NSNID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure non-invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure non-invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SNID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure non-invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure non-invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DDEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000111011100000010101000000100" edc:mclr="01000111011100000010101000000100" edc:_addr="0xE000EFBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:nzwidth="0xC" edc:desc="Architecture Part"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:nzwidth="0x4" edc:desc="Architecture Version"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:nzwidth="0x1" edc:desc="DEVARCH Present"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:nzwidth="0xB" edc:desc="Architect"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0xE000EFC0"/>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DDEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0xE000EFCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:nzwidth="0x4" edc:desc="Major type"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:nzwidth="0x4" edc:desc="Sub-type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE000EFD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="DES_2" edc:nzwidth="0x4" edc:desc="JEP106 continuation code"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000EFD4"/>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000EFD8"/>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000EFDC"/>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE000EFE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PART_0" edc:nzwidth="0x8" edc:desc="Part number bits[7:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
